{
  "backend/main.mo": "Motoko backend actor that manages a score system with functions to add, get, reset scores per caller Principal, and retrieve top scores using a Map data structure.",
  "feature_evidence.json": "Feature evidence report documenting implemented features including 3D environment, ghost entities, player interaction, UI display, dark horror theme, and asset rendering with associated files and test IDs.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend source files describing their roles in the ghost hunting game application.",
  "frontend/index.css": "Tailwind CSS base styles with custom CSS variables defining a dark horror color palette using OKLCH color space for light and dark themes.",
  "frontend/index.html": "HTML entry point that sets up the root div and loads the main TypeScript module for the Ghost Hunt application.",
  "frontend/src/App.tsx": "Root React component that conditionally renders either the start screen with game title and play button, or the active game with 3D scene and UI overlay based on game state.",
  "frontend/src/components/Crosshair.tsx": "Renders a fixed crosshair overlay in the center of the screen with a center dot, four directional lines, and an outer ring for targeting ghosts.",
  "frontend/src/components/Game3DScene.tsx": "React Three Fiber Canvas component that sets up the 3D scene with lighting, fog, camera controls, environment, spawned ghosts, and crosshair overlay.",
  "frontend/src/components/GameEnvironment.tsx": "Renders the 3D game environment including ground plane, cylindrical forest background with texture, and atmospheric fog particles with subtle rotation animation.",
  "frontend/src/components/GameLayout.tsx": "Layout wrapper component providing dark background, decorative moon image, main content area, and footer with caffeine.ai attribution link.",
  "frontend/src/components/GameUI.tsx": "Overlay UI component displaying the current score with ghost icon, reset button, and gameplay instructions using glassmorphism card styling.",
  "frontend/src/components/Ghost.tsx": "Interactive 3D ghost sprite component with floating animation, autonomous drifting movement, click-to-catch interaction, hover effects, and catching animation that increments score.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages an ICP actor instance based on Internet Identity authentication state, automatically invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useGameScore.ts": "React hook that provides game score state and an incrementScore function by wrapping useGetScore and useAddScore query hooks.",
  "frontend/src/hooks/useGameState.ts": "React hook that manages game status state (idle, playing, paused) with functions to start, pause, resume, and reset the game.",
  "frontend/src/hooks/useGhostSpawner.ts": "React hook that spawns up to 8 ghosts at random 3D positions, creates 3 initial ghosts, and spawns new ones every 3 seconds with removal capability.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login/logout flow, identity state, and AuthClient lifecycle with delegation validation.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching and mutating game score data through the ICP actor, with automatic cache invalidation on score updates.",
  "frontend/src/index.css": "Global CSS with Tailwind setup, dark horror theme color variables using OKLCH color space, custom scrollbar styling, Creepster and Inter font imports, and crosshair cursor for canvas.",
  "frontend/src/main.tsx": "Application entry point that renders the root component wrapped with QueryClientProvider and InternetIdentityProvider for state management and authentication.",
  "frontend/tailwind.config.js": "Tailwind configuration defining dark horror theme colors with OKLCH values, custom animations (float, pulse-glow, accordion), typography setup, and extended utility classes for the game UI.",
  "project_state.json": "Project metadata tracking implemented features (3D environment, ghost entities, player interaction, UI, horror theme) and pending features (score tracking system) for a ghost hunting game."
}